"""
  day06 复习
  容器:存储一系列数据.
    字符串:存储字符，不可变
    元组:存储变量，不可变(按需分配),
    列表:存储变量，可变(预留空间),序列(有序),灵活(索引／切片)
    字典:存储键值对，可变,散列(无序),读写速度最快(利用空间换取时间),相比列表可读性高
"""

t01 = (1, "a")

l01 = ["qtx", "mz"]
l01.append("azx")

d01 = {"qtx": 100, "mz": 99}
d01["azx"] = 101

print(d01)

del l01[0], d01["qtx"]

# -------合并多个容器-------------
list01 = [1, 2]
print(id(list01))  # 140009859166152
list01 += [3, 4]  # 将3,4追加到list01指向的列表[1,2]中
print(id(list01))  # 140009859166152
print(list01)  # [1, 2, 3, 4] 原有基础上增加新元素(可变)

tuple01 = (1, 2)
print(id(tuple01))  # 140009859225032
tuple01 += (3, 4)  # 创建新元素,替换tuple01地址．
print(id(tuple01))  # 140009883130600
print(tuple01)  # (1, 2, 3, 4) 原有元组成为垃圾(不可变)

# dict01 = {"qtx": 100}
# dict01 += {"mz": 99} # 错误

dict01 = {"qtx": 100}
dict02 = {"mz": 99}
dict03 = {**dict01, **dict02}
print(dict03)


