"""
  day03 复习
  变量:
    变量名称 = 表达式
  语句
    选择语句
              if 条件1:
                 满足条件1执行的代码
              elif 条件2:
                 满足条件2执行的代码
              else:
                 以上条件都不满足执行的代码

              if 条件1:
                 满足条件1执行的代码
              if 条件2:
                 满足条件2执行的代码
              if 条件3:
                 满足条件3执行的代码
    循环语句
      while 条件:
          循环体

      # 死循环:循环条件永远满足
      while True:
        循环体
        if 退出条件:
          break

      count = 0
      while count <=4:
        count+=1
        # 循环体

  调试:
      1. 加断点
      2. Debug
      3. 进入断点后逐语句执行
         审查执行流程,变量取值.
      4. 停止调试 Ctrl+ F2
"""







