"""
4. (1)存储多个商品信息,在控制台中显示出来.
   屠龙刀,10000元
   倚天剑,10000元
   打狗棒,5000元
"""
# 可以通过索引或者切片定位多个商品
list01 = [
  {"屠龙刀": 10000},
  {"倚天剑": 10000}
]

for dic in list01:
  for key, value in dic.items():
    print("商品名称是：%s,单价是:%d" % (key, value))

# 可以最为快速的定义某一个商品
dict02 = {
  "屠龙刀": 10000,
  "倚天剑": 10000,
}

for key, value in dict02.items():
  print("商品名称是：%s,单价是:%d" % (key, value))

"""
   (2)存储全国各个城市的景区与美食,在控制台中显示出来.
  　北京：
        景区：故宫,天安门,天坛.
        美食: 烤鸭,炸酱面,豆汁,卤煮.
    四川:
        景区：九寨沟,峨眉山,春熙路．
        美食: 火锅,串串香,兔头.
"""
# 10:50 上课
dict03 = {
  "北京": {
    "景区": ["故宫", "天安门", "天坛"],
    "美食": ["烤鸭", "炸酱面", "豆汁", "卤煮"],
  },
  "四川": {
    "景区": ["九寨沟", "峨眉山", "春熙路"],
    "美食": ["火锅", "串串香", "兔头"]
  }
}
# 获取北京的美食
# print(dict03["北京"]["美食"])
for city, info in dict03.items():
  print(city)
  for key, value in info.items():
    print("\t%s:%s" % (key, value))
