'''
函数参数
    ----实际参数
'''


def fun01(a, b, c, d):
    print(a)
    print(b)
    print(c)
    print(d)


# 位置传参 : 实参与行惨的为止依次对应
# fun01(1,2,3,4)

# -----序列传参 ： * 号将列表拆开后与形参【位置依次对应】
# list01 = [1, 2, 3, 4]
# fun01(*list01)

# 关键字传参 : 实参与形参根据形参的【名称对应】
# fun01(b=1, c=2, d=3, a=4)

# -----字典传参 : **将字典拆分后与形参的名字进行对应
# dict = {"d": 4, "c": 3, "a": 2, "b": 1}
# fun01(**dict)


# 形参中的默认函数 ： 如果不传递函数，可以使用默认值代替
def fun02(a, b=0, c=0, d=0):
    print(a)
    print(b)
    print(c)
    print(d)


fun02(1, 2, 3, 4)
fun02([1, 58, 2])
# 关键字传参 ： 可以选择性的为形参赋值



# 万能传参函数
def fun07(*args,**kwargs):
    pass





