"""
  day09 复习
  面向对象
    面向过程:考虑细节,逐步实现.          "干活的人"
    面向对象:识别对象/分配职责/建立交互   "雇人干活"
    类和对象:
      -- 语法:
            创建类
            class 类名:
              def __init__(self,参数):
                self.数据 = 参数


              def 行为(self):
                方法体

            创建对象
            构造函数指的是类中的__init__方法
            变量名 = 构造函数(参数)
      -- 类: 类别   抽象的    例如:水果
      -- 对象:个体   具体的   例如:香蕉
      问题:先有类还是先有对象?
      -- 设计角度:先有对象,再有类.  抽象化过程.
      -- 编码角度:先有类,再有对象.  具体化过程.

      类和对象的区别:抽象与具体
      类和类的区别:行为的不同
      对象与对象的区别:数据的不同
"""
